Autodesk.Revit.DB.Electrical.InsulationMaterial.GetInsulationMaterials(Autodesk.Revit.DB.Document)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.InsulationMaterial.GetInsulationMaterialIdByName(Autodesk.Revit.DB.Document,System.String)
Gets the Conductor Insulation Material id by given Conductor Insulation Material name.
document:
The document.
name:
The Conductor Insulation Material name.
Returns:
The Conductor Insulation Material id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.InsulationMaterial.GetInsulationMaterialIds(Autodesk.Revit.DB.Document)
Gets all the Conductor Insulation Material ids in the given document, sorted by name.
document:
The document.
Returns:
All the Conductor Insulation Material ids in this document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.InsulationMaterial.GetInsulationMaterial(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the Conductor Insulation Material data by given Conductor Insulation Material id.
document:
The document.
insulationMaterialId:
The Conductor Insulation Material id.
Returns:
The Conductor Insulation Material data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
The id is not a Conductor Insulation Material id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.InsulationMaterial.Create(Autodesk.Revit.DB.Document)
Creates a Conductor Insulation Material.
document:
The document.
Returns:
The newly created Conductor Insulation Material data.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Electrical.InsulationMaterial.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Electrical.InsulationMaterial.Name
The Conductor Insulation Material name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: name is an empty string or contains only whitespace.
-or-
When setting this property: name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
When setting this property: name is not unique in document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.InsulationMaterial.Id
The Conductor Insulation Material id.
Since:
2026

Autodesk.Revit.DB.Electrical.InsulationMaterial
This class represents the definition of Conductor Insulation Material data.
Since:
2026